uhnp/src/InformationRegisters/ТелеграмПользователи/ТелеграмПользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмПользователи</name>
  <resources>
    <name>ТелеграмИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелеграмФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УИДПользователя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Администратор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТелеграмБот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ТелеграмНастройки/ТелеграмНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмНастройки</name>
  <resources>
    <name>Api</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>AdminChatId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТелеграмБот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ТелеграмПользователи/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.ТелеграмБот) Тогда
		Запись.ТелеграмБот = ТелеграмСерверУХ.ПолучитьТелеграмБотаПоУмолчанию();
	КонецЕсли;
	
	ДоступностьИдентификацииПоТелефону();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	Запись.УИДПользователя = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелеграмИмяПриИзменении(Элемент)
	
	Запись.УИДПользователя = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелеграмФамилияПриИзменении(Элемент)
	
	Запись.УИДПользователя = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) <> Тип("ТаблицаФормы") Тогда
		Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ТокенЗаполнен = ЗначениеЗаполнено(ТелеграмСерверУХ.ПолучитьТокенТелеграмБота());
	
	Элементы.ДекорацияТребуетсяНастроить.Видимость = НЕ ТокенЗаполнен;
	Элементы.Пользователь.Доступность = ТокенЗаполнен;
	Элементы.Администратор.Доступность = ТокенЗаполнен;
	Элементы.ГруппаВариантыИдентификации.Доступность = ТокенЗаполнен;
	Элементы.УИДПользователя.Доступность = ТокенЗаполнен;
			
КонецПроцедуры

&НаСервере
Функция ЕстьАдминистраторТелеграм()
	
	ЗапросПоАдминистратору = Новый Запрос("ВЫБРАТЬ
	|	ТелеграмНастройки.AdminChatId КАК AdminChatId
	|ИЗ
	|	РегистрСведений.ТелеграмНастройки КАК ТелеграмНастройки
	|ГДЕ
	|	ТелеграмНастройки.ТелеграмБот = &ТелеграмБот
	|	И ТелеграмНастройки.AdminChatId <> 0");
	
	ЗапросПоАдминистратору.УстановитьПараметр("ТелеграмБот", ТелеграмСерверУХ.ПолучитьТелеграмБотаПоУмолчанию());
	ВыборкаПоАдминистратору = ЗапросПоАдминистратору.Выполнить().Выбрать();
	
	Возврат ВыборкаПоАдминистратору.Следующий();
	
КонецФункции

&НаСервере
Процедура ДоступностьИдентификацииПоТелефону()
	
	ЕстьАдминистратор = ЕстьАдминистраторТелеграм();
	Элементы.Телефон.Видимость = ЕстьАдминистратор;
	Элементы.ДекорацияИдентификацияПоТелефону.Видимость = ЕстьАдминистратор;
	Элементы.ДекорацияИдентификацияПоТелефонуНеВозможна.Видимость = НЕ ЕстьАдминистратор;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТелеграмБот(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ", ТелеграмСерверУХ.ПолучитьТелеграмБотаПоУмолчанию());
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеИзмененияТелеграмБота", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ТелеграмБоты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияТелеграмБота(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Запись.Телефон = "";
	Запись.ТелеграмИмя = "";
	Запись.ТелеграмФамилия = "";
	Запись.Администратор = Ложь;
	Запись.УИДПользователя = 0;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДоступностьИдентификацииПоТелефону();
	
КонецПроцедуры
